Revit 2024 API
OrdinateDimensionSetting.OriginTickMarkId Property
 Specifies the id of the tick mark element to use for the dimension origin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public ElementId OriginTickMarkId { get; set; }
Visual Basic
Public Property OriginTickMarkId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ OriginTickMarkId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace